while True:
    a = int(input("Введіть перше число: "))
    b = input("Оберіть дію (+, -, *, /): ")
    c = int(input("Введіть друге число: "))
    d = "Невірні дані"

    if b == "+":
        d = a + c
    elif b == "-":
        d = a - c
    elif b == "*":
        d = a * c
    elif b == "/":
        if c == 0:
            print("Помилка: Ділити на 0 неможливо")
        else:
            d = a/c
    else:
        print("обрано не коретну дію")
    print('результат обчислення: ', d)
    p = input("для нового обчислення введіть 'y'\nдля виходу з програми введіть будь-який інший символ \n")

    if p.lower() == 'y':
        continue
    else:
        break
print("Завершення роботи")