# 0 -> 0 днів, 00:00:00
# 224930 -> 2 дні, 14:28:50
# 466289 -> 5 днів, 09:31:29
# 950400 -> 11 днів, 00:00:00
# 1209600 -> 14 днів, 00:00:00
# 1900800 - > 22 дні, 00:00:00
# 8639999 -> 99 днів, 23:59:59
# 22493 -> 0 днів, 06:14:53
# 7948799 -> 91 день, 23:59:59

a = int(input("Введіть число, яке більше, або дорівнює 0 і менше за 8640000: "))

b = divmod(a, 86400)
c = divmod(b[1], 3600)
d = divmod(c[1], 60)
if b[-1] == 0 or 5 or 6 or 7 or 8 or 9:
    print(b[0], "днів ", end='')
elif b[-1] == 1:
    print(b[0], "день ", end='')
elif b[-1] == 2 or 3 or 4:
    print(b[0], "днi ", end='')
print(c[0], str(d[0]).zfill(2), str(d[1]).zfill(2), sep=":")


